app/controllers/comments_controller.rb

INSERT INTO "comments" ("subject", "body", "user_id", "idea_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject", "two to one"], ["body", "message from two to one"], ["user_id", 2], ["idea_id", 1], ["created_at", "2017-07-21 08:29:49.253882"], ["updated_at", "2017-07-21 08:29:49.253882"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user

    if @comment.save