app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @ideas = Idea.all

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_idea
      @idea = Idea.find(params[:id])