app/controllers/oauth_controller.rb

SELECT  "users".* FROM "users" WHERE (github_id = 26963749 OR email = NULL) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "users" ("username", "github_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "maxeskell"], ["github_id", 26963749], ["created_at", "2017-07-21 14:23:30.863530"], ["updated_at", "2017-07-21 14:23:30.863530"]]
---
  def github
    token = HTTParty.post("https://github.com/login/oauth/access_token", {
      query: {
        client_id: ENV["GITHUB_INCUBATE_ID"],
        client_secret: ENV["GITHUB_CLIENT_INCUBATE_SECRET"],
        code: params[:code]
      },
      headers: { "Accept" => "application/json" }
      }).parsed_response

      profile = HTTParty.get("https://api.github.com/user", {
        query: token,
        headers: { "User-Agent" => "HTTParty", "Accept" => "application/json" }
        }).parsed_response

        user = User.where("github_id = :github_id OR email = :email", github_id: profile["id"], email: profile["email"]).first

        user = User.new(username: profile["login"], email: profile["email"]) unless user

        user[:github_id] = profile["id"]

        if user.save

SELECT  "users".* FROM "users" WHERE (email = NULL OR facebook_id = '10154837786948951') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("username", "facebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Max Es"], ["facebook_id", "10154837786948951"], ["created_at", "2017-07-21 14:23:44.378940"], ["updated_at", "2017-07-21 14:23:44.378940"]]
---
      def facebook
        token = HTTParty.post('https://graph.facebook.com/v2.8/oauth/access_token', {
          query: {
            client_id: ENV["FB_OAUTH_INCUBATE_ID"],
            redirect_uri: ENV["APP_URL"] << "/" || "http://localhost:7000/",
            client_secret: ENV["FB_OAUTH_INCUBATE_SECRET"],
            code: params[:code]
          },
          headers: { 'Accept' => 'application/json'}
          }).parsed_response

          p token

          profile = HTTParty.get('https://graph.facebook.com/v2.5/me?fields=id,name,email,picture.height(961)', {
            query: token,
            headers: {
              'User-Agent' => 'HTTParty',
              'Accept' => 'application/json'
            }
            }).parsed_response

            p profile


            user = User.where("email = :email OR facebook_id = :facebook_id", email: profile["email"], facebook_id: profile["id"]).first

            user = User.new username: profile["name"], email: profile["email"] unless user

            user.facebook_id = profile["id"]

            if user.save